order_service/app/controllers/orders_controller.rb

  def create
    @order = Order.find_or_initialize_by(user_id: @current_user_id, status: "cart")

    @order_item = @order.order_item.find_by(product_id: order_item_params[:product_id])

    if @order_item
      @order_item.update(quantity: @order_item.quantity + order_item_params[:quantity])
    elsif
      @order.order_item.build(order_item_params)
    end

    if @order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "cart"], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 3], ["product_id", 2], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total_price", 69.6], ["updated_at", "2023-11-27 12:11:25.173680"], ["id", 1]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 2], ["updated_at", "2023-11-29 09:23:15.819935"], ["id", 23]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 1], ["updated_at", "2023-11-28 06:27:55.665372"], ["id", 12]]
INSERT INTO "orders" ("user_id", "status", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["status", "cart"], ["total_price", nil], ["created_at", "2023-11-28 05:30:15.259790"], ["updated_at", "2023-11-28 05:30:15.259790"]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 3], ["product_id", 2], ["quantity", 1], ["price", 15.0], ["created_at", "2023-11-28 06:10:43.586252"], ["updated_at", "2023-11-28 06:10:43.586252"]]

  def update
    @order = Order.find(params[:id])
    if @order
      if @order.update(order_params)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "pending"], ["updated_at", "2023-11-28 06:49:55.174013"], ["id", 3]]

  def update_item
    @order_item = @order.order_item.find_by(product_id: params[:product_id])

    if @order_item
      if @order_item.update(order_item_params)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 3], ["product_id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", 10.5], ["updated_at", "2023-11-28 06:27:55.672280"], ["id", 3]]
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["quantity", 2], ["updated_at", "2023-11-29 09:06:06.271281"], ["id", 20]]

  def destroy_item
    @order_item = @order.order_item.find_by(product_id: params[:product_id])
    if @order_item
      if @order_item.destroy
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."product_id" = $2 LIMIT $3  [["order_id", 3], ["product_id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 13]]

  def set_order
    @order = Order.find_by(user_id: @current_user_id, status: "cart")
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "cart"], ["LIMIT", 1]]