product_service/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Product Name another 19"], ["description", "Product Description"], ["price", 10.99], ["created_at", "2023-11-27 06:39:36.994015"], ["updated_at", "2023-11-27 06:39:36.994015"]]
---
    def create
        @product = Product.new(product_params)
        # attach_images if product_params[:images]

        if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "New product description modified"], ["updated_at", "2023-11-24 04:45:13.113965"], ["id", 6]]
---
    def update
        # attach_images if product_params[:images]

        if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 6]]
---
    def destroy
        if @product.destroy