order_service/app/models/order_item.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 3]]
UPDATE "orders" SET "total_price" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total_price", 69.6], ["updated_at", "2023-11-28 06:10:57.857954"], ["id", 3]]
---
    def update_total_price
        updated_total = self.order.order_item.sum { |item| item.price * item.quantity }
        self.order.update(total_price: updated_total)